recipes/vegan-meatballs-with-gravy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vegan Meatballs with Gravy</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Vegan Meatballs with Gravy</h1>
<p>
<a href="https://elavegan.com/vegan-meatballs-gravy-gluten-free-recipe/">Original link</a>
</p>

<div id="outline-container-org5706a5f" class="outline-2">
<h2 id="org5706a5f">Ingredients</h2>
<div class="outline-text-2" id="text-org5706a5f">
</div>
<div id="outline-container-org7ece5c6" class="outline-3">
<h3 id="org7ece5c6">Vegan meatballs:</h3>
<div class="outline-text-3" id="text-org7ece5c6">
<ul class="org-ul">
<li>One 400 g can black beans , drained and rinsed (250 g)</li>
<li>1/4 cup sunflower seeds (35 g)</li>
<li>1/2 cup oats (gluten-free if needed) (45 g)</li>
<li>2 tbsp tomato paste (60 g)</li>
<li>2 cloves of garlic</li>
<li>1/2 large onion, chopped</li>
<li>2 tbsp ground chia seeds or flax seeds</li>
<li>Spice mix: 1/2 tbsp onion powder, 1 tsp garlic powder, 1 tsp ground</li>
<li>oregano, 1 tsp ground cumin, 1/2 tsp smoked paprika, 1/4 tsp red pepper</li>
<li>flakes</li>
<li>Sea salt and pepper to taste</li>
<li>Oil for frying</li>
</ul>
</div>
</div>

<div id="outline-container-org889467a" class="outline-3">
<h3 id="org889467a">Mashed taters:</h3>
<div class="outline-text-3" id="text-org889467a">
<ul class="org-ul">
<li>6 medium-sized potatoes</li>
<li>1/4 cup coconut milk canned (60 ml) (*see recipe notes)</li>
<li>1/2 tsp nutmeg (or more/less to taste)</li>
<li>black pepper, sea salt to taste</li>
</ul>
</div>
</div>

<div id="outline-container-org718df49" class="outline-3">
<h3 id="org718df49">Gravy:</h3>
<div class="outline-text-3" id="text-org718df49">
<ul class="org-ul">
<li>1 1/2 cups vegetable broth or water (360 ml)</li>
<li>1/3 cup plant-based cream or canned coconut milk (80 ml)</li>
<li>2 tbsp tomato paste (60 g)</li>
<li>1/2 tsp fresh ginger (minced)</li>
<li>Ground spice mix: 3 tsp curry powder, 1 1/2 tsp onion powder, 1 tsp</li>
<li>garlic powder, 1 tsp oregano, 1 tsp cumin, 1 tsp turmeric, 1/2 tsp</li>
<li>nutmeg, 1/2 tsp smoked paprika, 1/4 tsp red pepper flakes, 1 tsp coconut</li>
<li>sugar (or brown sugar), sea salt and pepper to taste</li>
<li>1 tbsp cornstarch (to thicken)</li>
<li>Fresh parsley to garnish</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8394559" class="outline-2">
<h2 id="org8394559">Method</h2>
<div class="outline-text-2" id="text-org8394559">
<ol class="org-ol">
<li>Preheat oven to 200&deg;C.</li>
<li>Prepare mashed potatoes as described in this recipe or make your favorite pasta or rice (whatever you want to serve with your vegan meatballs).</li>
</ol>
</div>

<div id="outline-container-orgb0da094" class="outline-3">
<h3 id="orgb0da094">Meatballs:</h3>
<div class="outline-text-3" id="text-orgb0da094">
<ol class="org-ol">
<li>Put all ingredients (except oil) to a food processor or blender and pulse a couple of times. Scrape down the sides and pulse again. Repeat for about one minute or until the mixture sticks together.</li>
<li>Roll the mixture with your hands into balls. I used 1 tbsp per ball (the recipe makes about 15 balls).</li>
<li>Heat 2-3 tbsp oil in a pan/skillet and fry balls for about 6-8 minutes over medium heat. Shake the pan from time to time to fry the balls evenly from all sides.</li>
<li>Transfer the balls to a baking sheet and bake in the oven for about 20 minutes.</li>
</ol>
</div>
</div>

<div id="outline-container-orgada8e36" class="outline-3">
<h3 id="orgada8e36">Mashed taters:</h3>
<div class="outline-text-3" id="text-orgada8e36">
<ol class="org-ol">
<li>Peel and chop potatoes, transfer them to a pot with salted water and bring to a boil.</li>
<li>Cook on medium heat for about 15 minutes or until tender, drain.</li>
<li>Transfer back to the pot, add coconut milk, nutmeg, black pepper and sea salt to taste and mash with a potato masher (don't use a food processor or blender).</li>
</ol>
</div>
</div>

<div id="outline-container-orgf3c8953" class="outline-3">
<h3 id="orgf3c8953">Gravy:</h3>
<div class="outline-text-3" id="text-orgf3c8953">
<ol class="org-ol">
<li>To make the gravy, simply add the tomato paste to a pan (use the same pan which you used for the vegan meatballs), pour in the plant-based cream and stir with a whisk to smooth out the tomato paste. Then slowly add the vegetable broth while stirring.</li>
<li>Bring the sauce to a boil, add all other ingredients (except cornstarch and fresh parsley) and let simmer over medium heat for about 10-12 minutes (the longer you simmer the gravy, the more flavorful and thicker it will be).</li>
<li>In a small bowl mix cornstarch with a little bit of water and add it to the pan. The gravy will get a little bit thicker. Keep simmering for a further 2-3 minutes.</li>
<li>Pour the gravy over the vegan meatballs and serve with either mashed potatoes, pasta or rice! Store leftovers of the gravy in a container in the fridge (can be kept in the fridge for about 3-4 days).</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
